import React, { useState } from "react";

export default function Navbar() {
    const [seachValue,setSerachValue] = useState("")

  return (
    <div className="bg-[#FAFAFA] p-6">
      <ul className="flex justify-center flex-row-reverse">
        <li className="flex items-center cursor-pointer">
          <span className="m-3">شبکه مردی فعالان حجاب</span>
          <img src="src\assets\Vector.png" className="w-7  h-7 " alt="" />
        </li>
        <li className="flex items-center cursor-pointer">
          <span className="m-3">تجربه</span>
          <svg
            width="31"
            height="25"
            viewBox="0 0 31 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M17.0469 3.57812L19.5312 3.90625C19.9531 4 20.1406 4.51562 19.8125 4.84375L18.0312 6.53125L18.4531 9.01562C18.5469 9.4375 18.0781 9.76562 17.6562 9.57812L15.5 8.40625L13.2969 9.57812C12.875 9.76562 12.4531 9.4375 12.5 9.01562L12.9219 6.57812L11.1406 4.84375C10.8125 4.51562 11 3.95312 11.4219 3.90625L13.9062 3.57812L14.9844 1.32812C15.2188 0.90625 15.7812 0.90625 15.9688 1.32812L17.0469 3.57812ZM12.5 13H18.5C19.2969 13 20 13.7031 20 14.5V23.5C20 24.3438 19.2969 25 18.5 25H12.5C11.6562 25 11 24.3438 11 23.5V14.5C11 13.7031 11.6562 13 12.5 13ZM2 16H8C8.79688 16 9.5 16.7031 9.5 17.5V23.5C9.5 24.3438 8.79688 25 8 25H2C1.15625 25 0.5 24.3438 0.5 23.5V17.5C0.5 16.7031 1.15625 16 2 16ZM21.5 20.5C21.5 19.7031 22.1562 19 23 19H29C29.7969 19 30.5 19.7031 30.5 20.5V23.5C30.5 24.3438 29.7969 25 29 25H23C22.1562 25 21.5 24.3438 21.5 23.5V20.5Z"
              fill="#2BAE66"
            />
          </svg>
        </li>
        <li className="flex items-center cursor-pointer">
          <span className="m-3">ایده</span>
          <svg
            width="17"
            height="24"
            viewBox="0 0 17 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M15.25 8.25C15.25 4.54688 12.2031 1.5 8.5 1.5C4.75 1.5 1.75 4.54688 1.75 8.25C1.75 9.70312 2.17188 11.0156 2.92188 12.0938C3.10938 12.375 3.34375 12.7031 3.57812 12.9844C4.1875 13.8281 4.84375 14.7656 5.35938 15.7031C5.78125 16.4531 6.01562 17.25 6.10938 18H4.60938C4.46875 17.4375 4.32812 16.9219 4.04688 16.4062C3.57812 15.5625 3.01562 14.7656 2.40625 13.9688C2.17188 13.6406 1.9375 13.3125 1.70312 12.9844C0.765625 11.625 0.25 10.0312 0.25 8.25C0.25 3.70312 3.90625 0 8.5 0C13.0469 0 16.75 3.70312 16.75 8.29688C16.75 10.0312 16.1875 11.625 15.25 12.9844C15.0156 13.3125 14.7812 13.6406 14.5469 13.9688C13.9844 14.7656 13.375 15.5625 12.9062 16.4062C12.625 16.9219 12.4844 17.4844 12.3906 18.0469H10.8438C10.9844 17.25 11.1719 16.4531 11.5938 15.7031C12.1094 14.7656 12.8125 13.8281 13.375 13.0312C13.6094 12.7031 13.8438 12.375 14.0312 12.1406C14.7812 11.0156 15.25 9.70312 15.25 8.25ZM6.34375 21C6.67188 21.8906 7.51562 22.5 8.45312 22.5C9.4375 22.5 10.2812 21.8906 10.6094 21H6.34375ZM4.75 20.25V20.0156C4.75 19.7344 4.9375 19.5 5.21875 19.5H11.7344C12.0156 19.5 12.25 19.7344 12.25 20.0156V20.25C12.25 22.3594 10.5625 24 8.5 24C6.39062 24 4.75 22.3594 4.75 20.25ZM8.5 4.5C8.875 4.5 9.25 4.875 9.25 5.25V11.25C9.25 11.6719 8.875 12 8.5 12C8.07812 12 7.75 11.6719 7.75 11.25V5.25C7.75 4.875 8.07812 4.5 8.5 4.5ZM9.625 15C9.625 15.6562 9.10938 16.125 8.5 16.125C7.84375 16.125 7.375 15.6562 7.375 15C7.375 14.3906 7.84375 13.875 8.5 13.875C9.10938 13.875 9.625 14.3906 9.625 15Z"
              fill="#2BAE66"
            />
          </svg>
        </li>
        <li className="flex items-center cursor-pointer">
          <span className="m-3">ایده</span>
          <svg
            width="25"
            height="24"
            viewBox="0 0 25 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M23 1.5H21.5C18.0312 1.5 15.0312 3.46875 13.5312 6.28125C13.2031 5.85938 12.875 5.4375 12.5 5.0625C14.375 2.01562 17.7031 0 21.5 0H23C23.7969 0 24.5 0.703125 24.5 1.5C24.5 6.70312 20.7031 11.0156 15.7344 11.8594C15.6875 11.3906 15.5938 10.875 15.4531 10.4062C19.7188 9.70312 23 6 23 1.5ZM3.5 4.5H2C2 9.46875 6.03125 13.5 11 13.5H12.5C12.5 8.53125 8.46875 4.5 3.5 4.5ZM2 3H3.5C9.26562 3 14 7.73438 14 13.5V14.25V15V23.25C14 23.6719 13.625 24 13.25 24C12.8281 24 12.5 23.6719 12.5 23.25V15H11C5.1875 15 0.5 10.3125 0.5 4.5C0.5 3.70312 1.15625 3 2 3Z"
              fill="#2BAE66"
            />
          </svg>
        </li>
        <div className="bg-bg w-[400px] focus-within:border focus-within:bg-[#fff] focus-within:border-[#2BAE66]  rounded-md flex flex-row-reverse justify-between p-3 items-center ">
          <input value={seachValue} onChange={e=>{
            setSerachValue(e.target.value)
          }}
           dir="rtl" type="text" className="h-full w-[90%] bg-[#E5E5E5] border-none outline-none focus:bg-[#fff] focus:border-1  focus:border-[#2BAE66]" />
              {seachValue.length ?(
            <svg
            onClick={e=>setSerachValue("")}
            width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M14.1875 15.3125L8 9.07812L1.76562 15.3125C1.48438 15.5938 1.01562 15.5938 0.6875 15.3125C0.40625 14.9844 0.40625 14.5156 0.6875 14.2344L6.92188 8L0.6875 1.8125C0.40625 1.53125 0.40625 1.0625 0.6875 0.734375C1.01562 0.453125 1.48438 0.453125 1.76562 0.734375L8 6.96875L14.1875 0.734375C14.4688 0.453125 14.9375 0.453125 15.2656 0.734375C15.5469 1.0625 15.5469 1.53125 15.2656 1.8125L9.03125 8L15.2656 14.2344C15.5469 14.5156 15.5469 14.9844 15.2656 15.3125C14.9375 15.5938 14.4688 15.5938 14.1875 15.3125Z" fill="#A3A3A3"/>
            </svg>
            
          ): ""}
          <svg
          className="mx-5"
            width="25"
            height="25"
            viewBox="0 0 25 25"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M18 9.75C18 6.84375 16.4062 4.125 13.875 2.625C11.2969 1.17188 8.15625 1.17188 5.625 2.625C3.04688 4.125 1.5 6.84375 1.5 9.75C1.5 12.7031 3.04688 15.4219 5.625 16.9219C8.15625 18.375 11.2969 18.375 13.875 16.9219C16.4062 15.4219 18 12.7031 18 9.75ZM16.0781 17.1562C14.3906 18.6562 12.1406 19.5 9.75 19.5C4.35938 19.5 0 15.1406 0 9.75C0 4.40625 4.35938 0 9.75 0C15.0938 0 19.5 4.40625 19.5 9.75C19.5 12.1875 18.6094 14.3906 17.1562 16.125L23.7656 22.7344C24.0469 23.0156 24.0469 23.5312 23.7656 23.8125C23.4844 24.0938 22.9688 24.0938 22.6875 23.8125L16.0781 17.1562Z"
              fill="#A3A3A3"
            />

          </svg>
      
        </div>
        <div className="bg-bg w-56 rounded-full flex items-center flex-row-reverse justify-between px-4">
            <div className="flex items-center flex-row-reverse">
                <img className="w-9 h-9 rounded-full ml-3" src="https://s3-alpha-sig.figma.com/img/85e1/3428/a12cc42d823aa54ab70c722749b08d85?Expires=1730678400&Key-Pair-Id=APKAQ4GOSFWCVNEHN3O4&Signature=JEqfYYopy78GhTx8xAvWRCT3a70rEhyqPRDaknvoCqEZtDCpiXETdKaEYYmfDM61GPsQGDScg74qYzIPjYo87gtGS7GVD-2bA~d-EQm~vQsz6EHu7vF7HWOPNoqP3a7ZZpiSQ6VWNRYdJkDa5JK1agkYaDFp1peJqTLvyEW1OYbcjeWl51IWUouxjjCrck0UtjHAOCVW0S~56kvd25M6ImG9~Zxfk4w50TsFq27C4il-MoNT2v8ak~W~q5gPfZg9WhPbNt9RYZDpThsuZrMS4KMMffLkBJYluCzoLr3BWYzvLaBjYdwNWXnOLc7nDeQCQzAzZXTP2iDOrVOvp3azRA__" alt="" />
            <span>همدل ۱</span>

            </div>
        <svg className="cursor-pointer" width="20" height="11" viewBox="0 0 20 11" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M10.5156 10.5625C10.2344 10.8438 9.71875 10.8438 9.4375 10.5625L0.4375 1.5625C0.15625 1.28125 0.15625 0.765625 0.4375 0.484375C0.71875 0.203125 1.23438 0.203125 1.51562 0.484375L10 8.96875L18.4375 0.484375C18.7188 0.203125 19.2344 0.203125 19.5156 0.484375C19.7969 0.765625 19.7969 1.28125 19.5156 1.5625L10.5156 10.5625Z" fill="#A3A3A3"/>
</svg>

        </div>
      </ul>
    </div>
  );
}
